flask/results/get-json/3.txt
This is ApacheBench, Version 2.3 <$Revision: 1901567 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 0.0.0.0 (be patient).....done


Server Software:        gunicorn
Server Hostname:        0.0.0.0
Server Port:            3000

Document Path:          /json
Document Length:        18 bytes

Concurrency Level:      10
Time taken for tests:   0.070 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      16300 bytes
HTML transferred:       1800 bytes
Requests per second:    1424.89 [#/sec] (mean)
Time per request:       7.018 [ms] (mean)
Time per request:       0.702 [ms] (mean, across all concurrent requests)
Transfer rate:          226.81 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     1    6   1.8      6      11
Waiting:        1    6   1.8      6      10
Total:          2    7   1.8      6      11

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      8
  75%      8
  80%      8
  90%      9
  95%     10
  98%     10
  99%     11
 100%     11 (longest request)